Dlubal.RFEM5.SupportConditionsType
Type of column support condition

Dlubal.RFEM5.SupportConditionsType.UnknownSupportConditionType
Unknown support condition

Dlubal.RFEM5.SupportConditionsType.HingedSupportType
Hinged support condition

Dlubal.RFEM5.SupportConditionsType.ElasticSupportType
Elastic support condition

Dlubal.RFEM5.SupportConditionsType.RigidSupportType
Rigid support condition